{"pagination":{"total":2352,"per_page":24,"current_page":1,"total_pages":98},"data":[{"id":"30880","heading":"Top 6 Immigration Visas for Startups","summary":"U.S. immigrants are abouttwice as likelyto become entrepreneurs as native-born Americans. They make up around 13% of the population, yet represent27.5% of all American entrepreneurs. Immigrant-founded top venture-backed firms have created an average of150 jobs per companyand include several household names such asGoogle, eBay, Yahoo, Nordstrom, AT&amp;T, Procter &amp; Gamble, and Goldman Sachs. In 2012 alone, a quarter of all tech and engineering start-ups had at least one immigrant cofoun...","author":"Lincoln Njogu","initiative":"Guest Post","full_link":"https:\/\/blog.ihub.co.ke\/2017\/09\/top-6-immigration-visas-for-startups\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/09\/business_immigration_to_europe-800x576.jpg","publication_date":"2017-09-18 10:24:40","categories":"Guest Post"},{"id":"30872","heading":"iHub, World Bank to showcase 20 promising digital entrepreneurs and locally  relevant innovations from East Africa","summary":" iHub and the World Bank Group will host a one-week intensive boot camp in Nairobi, a part of a business acceleration program to help East African tech start-ups commercialize and scale innovative digital products. \nThe Traction Camp accelerator, launched six months ago by iHub and the World Bank Group’s infoDev program, will connect 20 high-growth start-ups with the knowledge, capital, and access to markets they need to grow. The program is supported by the governments of Norway, Sweden, Finl...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/09\/ihub-world-bank-to-showcase-20-promising-digital-entrepreneurs-and-locally-relevant-innovations-from-east-africa\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/09\/IMG_9384.jpg","publication_date":"2017-09-14 16:15:41","categories":"iHub"},{"id":"30858","heading":"Highlights from running the iHub- MAVC project","summary":"The iHub and Making All Voices Count (MAVC) have been working together since 2016 to facilitate technology ecosystem governance. This is being achieved through bringing together ecosystem players to collaborate in order to better understand problems affecting service delivery; as well as provide startups in the service delivery space with tools to facilitate their expansion, especially to counties. Supporting county government is an integral part of the partnership owing to the crucial role th...","author":"Anne","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/09\/highlights-from-running-the-ihub-mavc-project\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/09\/IMG_1718.jpg","publication_date":"2017-09-18 11:13:36","categories":"iHub"},{"id":"30853","heading":"Marriott Hotels launches TestBED in Middle East & Africa","summary":"Technology is, without a doubt, shaping our future – and its effect on the travel and technology industry is one that can transform a guest experience. Marriott Hotels takes pride in staying ahead of the curve, and in a continuing effort to find cutting-edge technologies that provide guests with the best, it has now launched its TestBED programme in the Middle East &amp; Africa. \nFirst launched by Marriott Hotels across Europe in 2016, the unique 10-week accelerator programme gives start-ups t...","author":"Editor","initiative":"Cross-Post","full_link":"https:\/\/blog.ihub.co.ke\/2017\/09\/marriott-hotels-launches-testbed-in-middle-east-africa\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/09\/https-2F2Fcdn.evbuc_.com2Fimages2F321940352F1396089413042F12Foriginal.png","publication_date":"2017-09-11 12:32:31","categories":"Cross-Post"},{"id":"30845","heading":"NRBuzz - Government Responsiveness in the Age of ICTs","summary":"\n“E-government is a super highway only accessed by a few”\n~ Focus Group Discussion participant from Nakuru\n\nHaving completed a successful round of focus group discussions in Nairobi, Nakuru, Kisumu and Mombasa we were honoured to host Chiefs from Nairobi and neighbouring counties on 29th August for a training on how to effectively use ICT tools to enhance citizen engagement, right here at the iHub.This was an opportunity to co-create with a subset of government officials on ways in which th...","author":"Tess Wandia","initiative":"iHub Research","full_link":"https:\/\/blog.ihub.co.ke\/2017\/09\/nrbuzz-government-responsiveness-in-the-age-of-icts\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/09\/IMG_9664.jpg","publication_date":"2017-09-05 07:33:51","categories":"iHub Research"},{"id":"30832","heading":"Call for Start Ups in the AEROspace technology in East Africa!","summary":"Airbus BizLab (working in collaboration with Novato Africa) recently launched the #Africa4Future initiative, targeting East African startups that are innovating for the future applicable to the aerospace business. The Airbus BizLab is a global aerospace accelerator bringing together start-ups and Airbus’ own entrepreneurs to transform innovative ideas into valuable businesses more quickly by combining scale and agility.\nAs competition in the aerospace industry intensifies, Airbus aims to accel...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/call-for-start-ups-in-the-aerospace-technology-in-east-africa\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/Airbus-Bizlab.jpg","publication_date":"2017-08-30 17:24:20","categories":"iHub"},{"id":"30827","heading":"Innovating for Kenya","summary":"On the 8th of August Kenyans across the country and across the world exercised their democratic right and responsibility to elect their political leaders. At the iHub we believe that innovation has a role to play in mitigating all the challenges we face as country and community, including delivering free, fair and credible elections. Together with our partners Ushahidi, Constitution &amp; Reform Education Consortium (CRECO) and InfoNet, we hosted the election situation room for Uchaguzi, a citiz...","author":"Nekesa Were","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/innovating-for-kenya\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/05\/IMG_1823.jpg","publication_date":"2017-08-30 14:35:24","categories":"iHub"},{"id":"30819","heading":"iHub launches Women In Entrepreneurship series","summary":"The iHub women in entrepreneurship series got off to an amazing start with our Get In And Get It event, which was attended by over one hundred women. \nThe aim of this session was to give women a jumpstart into the entrepreneurship space. We had five inspiring women speak and share their experiences in entrepreneurship. Mugure Warobi Nderitu, owner of Little Paws Montessori House spoke about how to make your product unique in a competitive market; Christine Khasinah-Odero, the Managing Director ...","author":"Nekesa Were","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/ihub-launches-women-in-entrepreneurship-series\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/ihubwie.jpg","publication_date":"2017-08-29 20:46:55","categories":"iHub"},{"id":"30775","heading":"French Tech Community Nairobi Design Contest","summary":"BACKGROUND\nThe French Tech initiative was launched by the French government in 2013 to Promote French start-ups on a national &amp; International level.\n It is represented by multiple French Tech Hubs and Community, in France and Abroad. \n The objectives of French Tech Nairobi is to gather different actors working in or for the French and the Kenyan tech ecosystems, and more broadly the East African tech ecosystem. \n We welcome all players who are involved in the growth of the startup community ...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/french-tech-community-nairobi-design-contest\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/La-French-Tech_1.jpg","publication_date":"2017-08-29 10:33:22","categories":"iHub"},{"id":"30762","heading":"Enda Athletic Inc. progress to Global Challenge Cup Festival","summary":"On August 22, 2017,iHub in partnership with 1776 andRevolution,held for Challenge Cup Nairobi, where 8 startups pitched for the chance to win a trip to the Global Final round of Challenge Cup!The startups included; Identigate Integrated Solutions Limited,Uthabiti Healthcare, Kenya Green Supply Ltd, Everwaters Inc., Mhogo Foods, Enda Athletic Inc. and Yusudi.\nThe judges included Nekesa Were (Director of Platform services at iHub), Frida Owinga (Founder of PassionProfit school of entrepr...","author":"Lincoln Njogu","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/enda-athletic-progress-to-global-challenge-cup\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/IMG_0412_1.jpg","publication_date":"2017-08-28 16:36:47","categories":"iHub"},{"id":"30750","heading":"Technovation:  Can Tech Entrepreneurs Solve Africa’s Development Challenges","summary":"{Guest post by Sheena}\nThere is real potential for technology entrepreneurs to be game-changers in solving development challenges in Africa provided there is a supportive high impact tech innovation ecosystem to help growth and scale. \nMuch has been written on the African tech scene; many referring to the Silicon Savannah as the beacon of hope with others more skeptical of the hype.  The African continent has the lowest levels of human and social development and struggles with age-old problems,...","author":"Editor","initiative":"Guest Post","full_link":"https:\/\/blog.ihub.co.ke\/?p=30750","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/Image-for-article.jpg","publication_date":"2017-08-21 18:56:19","categories":"Guest Post"},{"id":"30738","heading":"The Safe Internet Conundrum","summary":"Photo Credit: How Cyber Crime Bill Will Protect Women\nIn the wake of the Sarahah taking over the social media scene in the past recent days, I got to thinking. Can a safe internet truly exist if the people dominating and using these spaces do not prioritise safety as a feature of the platform they are using? I’ve gotten resigned to the fact that trolls will always exist, mostly because there are so many avenues, mindsets, tools and situations that create an environment for internet trolls to t...","author":"Tess Wandia","initiative":"iHub Research","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/the-safe-internet-conundrum\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/Cybercrime_compressed-640x400.jpg","publication_date":"2017-08-21 14:11:53","categories":"iHub Research"},{"id":"30719","heading":"This Week at iHub","summary":"Check out some of the events we're hosting this week at the iHub. Mark your Calendar!\nWorkshop: The 4th industrial revolution is here\nOn Tuesday 22nd August 2017 from 5.30pm, Roche Mamabolo will conduct a workshop on ideation to commercialization titled 'The 4th Industrial Revolution is here'.\nThe 4th Industrial Revolution is here!\nWe stand on the brink of a technological revolution that will fundamentally alter the way we live, work, and relate to one another. In its scale, scope, and complexi...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/this-week-at-the-ihub\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/This-week-iHub.jpg","publication_date":"2017-08-21 12:05:11","categories":"iHub"},{"id":"30698","heading":"iHub Women In Entrepreneurship: Get In and Get It!","summary":"The iHub is excited to join the communities in Kenya and around the world that curate and host opportunities for women to meet and engage in conversations centered around entrepreneurship.\nBeginning 24th August, 2017, the iHub will host a women in entrepreneurship series which will be open to everyone. We do aim though to have good representation from women considering entrepreneurship as a career path, high potential, early stage women-led business owners, seasoned women-led business owners, or...","author":"Nekesa Were","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/ihub-women-in-entrepreneurship-get-in-and-get-it\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/WOMEN.jpg","publication_date":"2017-08-21 09:57:18","categories":"iHub"},{"id":"30686","heading":"Three Exceptional Startups Stand a Chance to Represent Kenya at GIA, Slush","summary":"Slush Global Impact Accelerator Kenya pitching event was held on 17th August at the iHub. The event saw seven startups battling for a chance to represent Kenya at the Global Impact Accelerator Program, Slush 2017, which will be held in Helsinki in Finland from 22nd November – 2 December 2017. \nSlush Global Impact Accelerator is a program created in collaboration with the Ministry of Foreign Affairs of Finland and multiple partners globally. The purpose of Slush is to create a leading global pr...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/three-exceptional-startups-stand-a-chance-to-represent-kenya-at-gia-slush\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/IMG_0323.jpg","publication_date":"2017-08-18 15:52:35","categories":"iHub"},{"id":"30672","heading":"Finalists and Judges announced: Challenge Cup 2017","summary":"Join iHub, in partnership with 1776 andRevolution, on August 22, 2017, for Challenge Cup Nairobi, where 9 startups will pitch for the chance to win a trip to the Global Final round of Challenge Cup! The event will take place from 12 noon to 5 pm at iHub Nairobi\nOne winner will advance with a free trip to the Global Finals at Challenge Festival from November 13-17, 2017. There, the finalists will compete for the grand prizes as well as spend time with the investors, customers, media and other ke...","author":"Lincoln Njogu","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/finalists-and-judges-announced-challenge-cup-2017\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/07\/CC-TW-copy.jpg","publication_date":"2017-08-19 09:22:50","categories":"iHub"},{"id":"30670","heading":"mLabs Do More Than Simply Create Tech Start-Ups","summary":"{Blog post by Yehia Eldozdar, Mutoni Karasanyi, and Sarah Craig}\nOver the last few years, there has been a lot of excitement around the potential impact of digital technologies to solve challenges and create jobs in the developing world. Those championing this strategy for growth and development have turned to young entrepreneurs with wildly imaginative ideas that just might work — if only they had a little business training.\n \n Since 2011,infoDevhas been piloting entrepreneurship support p...","author":"Editor","initiative":"Cross-Post","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/mlabs-do-more-than-simply-create-tech-start-ups\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/photo1_0.png","publication_date":"2017-08-18 15:45:56","categories":"Cross-Post"},{"id":"30660","heading":"Event: Challenge Cup Nairobi, 2017","summary":"Join iHub,in partnership with 1776 andRevolution,on August 22, 2017 for Challenge Cup Nairobi, where 8-10 startups will pitch for the chance to win a trip to the Global Final round of Challenge Cup! The event will take place from 12 noon to 5pm\nChallenge Cup is a worldwide tournament for the most promising, innovative startups to win prizes, make connections, and share their vision on a global stage. This year, 1776 is partnering with 75 cities to host Challenge Cup Local events, and iHub is ...","author":"Lincoln Njogu","initiative":"iHub Community","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/attend-challenge-cup-nairobi-2017\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/07\/CC-TW-copy.jpg","publication_date":"2017-08-16 12:44:56","categories":"iHub Community,Startups"},{"id":"30647","heading":"Join the iHub community today!","summary":"We invite you to join one of the most dynamic communities in the world, and get access to great resources for entrepreneurs as part of the mix! \nOur community is made up of an eclectic group of people drawn to each other by a common love for, entrepreneurship, technology and innovation. \nAt the iHub we say that if it does not work for our community then we will not do it. The interests of our community drives everything that we do. The community comes first. Understandably then we take great pr...","author":"Nekesa Were","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/join-the-ihub-community-today\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/ihub_blog.jpg","publication_date":"2017-08-16 22:51:41","categories":"iHub,iHub Community"},{"id":"30642","heading":"Opportunities to Maximize This Week","summary":"For the last seven years, the iHub has played a critical role in fostering the development of the tech community in Kenya. We receive dozens of emails and queries with amazing resources and opportunities. This information is often extremely useful to startups, entrepreneurs, developers, corporates, and others within the tech ecosystem. We are eager to share this information with you via social media and most importantly through your membership at the iHub. To sign up for membership at the iHub, ...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/opportunities-to-maximize-this-week-4\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/Opportunities.jpg","publication_date":"2017-08-15 18:04:21","categories":"iHub"},{"id":"30639","heading":"How Effective is Your Application?","summary":"One of my colleagues at iHub has an interesting work philosophy. He usually says:\n\n I will not work on any project that is obviously a waste of time no matter how much I am paid.\n\nThis obviously reflects a great craftsmanship ethic. Such a philosophy does remain useful throughout the entire organization. No one wants to waste resources on projects that are not going to bear any fruit.\nIn this entry, we will be looking at how you can test if your application is fit for its purpose.\nThat is, does...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/?p=30639","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/eyeglasses-2003188_1280.jpg","publication_date":"2017-08-15 18:00:14","categories":"iHub"},{"id":"30634","heading":"5 Ways To Help Clients Find Your Business Worthy","summary":"{Guest post by Clara}\nWhether you are a novice businessman or a great entrepreneur, one of the main aim of yours is to attract more and more potential clients, isn’t it? But, your competitors are also trying to do the same! So, there should be some attractive features in you so that your clients will choose you over them.\nWondering what should be those astounding facts in you that your clients will find worth enough? Well, in that context, I am going to clarify your doubts with the following p...","author":"Editor","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/?p=30634","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/ThinkstockPhotos-183712392-c.jpg","publication_date":"2017-08-15 11:53:29","categories":"iHub"},{"id":"30627","heading":"Slush Global Impact Accelerator Finds & Helps The Best Impact Startup From Emerging Markets","summary":"Slush Global Impact Accelerator (GIA)was initialized in collaboration withthe Ministry of Foreign Affairs of Finlandandseveral global partnersin 2015. The purpose of the program is to support impact startups from emerging markets. This year tens of entrepreneurs from 20 countries will join Slush in Helsinki in late November to accelerate their businesses.\nGIA start-ups are on the frontline of developing both local and global solutions to implement theAgenda 2030, and to meet theSustainabl...","author":"Editor","initiative":"Cross-Post","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/slush-global-impact-accelerator-finds-helps-the-best-impact-startup-from-emerging-markets\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/Slush_GIA_some.png","publication_date":"2017-08-14 12:56:27","categories":"Cross-Post"},{"id":"30606","heading":"Identification in the Age of ICTs","summary":"The Kenyan government is at the forefront when it comes to ICT adoption. The ICT tools adopted were set up to provide efficient service and facilitate communication with citizens. Netizens have witnessed Facebook video chats by the President, hashtags used by political parties to push their agenda, government websites and social media accounts setup to interact with citizens, among many. All these give an impression that ICTs have enabled a two way communication, however, is it the case? This pr...","author":"Nasubo Ongoma","initiative":"iHub","full_link":"https:\/\/blog.ihub.co.ke\/2017\/08\/identification-in-the-age-of-icts\/","image_link":"https:\/\/blog.ihub.co.ke\/wp-content\/uploads\/2017\/08\/kenya-653064_1920-1.png","publication_date":"2017-08-02 15:23:44","categories":"iHub,iHub Research"}]}
